# Core Type Enumeration

Source: https://www.revitapidocs.com/2026/49b70584-a75e-f4ca-f454-4cbb06f4a309.htm

---

| Core Type Enumeration |
| --- |

An enumerated type to list all core types.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum CoreType
```

```
Public Enumeration CoreType
```

```
public enum class CoreType
```

```
type CoreType
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| MultiCore | 1 | Core type is multi core. |
| SingleCore | 0 | Core type is single core. |

See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace